[
  {
    "id": 1,
    "estate_title": "Luxury Villa with Ocean View",
    "category": 1,
    "description": "Experience luxury living in this beautiful villa overlooking the ocean. This magnificent villa offers a serene escape from the hustle and bustle of daily life. With spacious rooms, modern amenities, and breathtaking views, this property is the epitome of elegance and comfort. The villa features a grand entrance foyer, multiple living areas, and an expansive outdoor terrace perfect for entertaining guests or enjoying quiet evenings with family. The gourmet kitchen is equipped with state-of-the-art appliances, while the luxurious bedrooms and bathrooms provide a sanctuary for relaxation. Outside, the lush landscaping surrounds a sparkling swimming pool and private garden, creating a tranquil oasis. Additional features include a home theater, gym, and outdoor kitchen, making this villa the ultimate retreat.",
    "price": "$1,500,000",
    "status": "sale",
    "area": "5000 sq ft",
    "location": "Miami, Florida",
    "facilities": [
      "Air Conditioning",
      "Basketball court",
      "Dryer",
      "Elevator",
      "Garage Attached",
      "Gym",
      "Heating",
      "Media Room",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "Swimming Pool",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedrooms": 5,
    "bathrooms": 6,
    "image": "https://i.ibb.co/QNmpSNb/Home-1.png"
  },
  {
    "id": 2,
    "estate_title": "Cozy Apartment in Downtown",
    "category": 2,
    "description": "This cozy apartment located in the heart of downtown offers convenience and comfort. Ideal for urban living enthusiasts, this apartment features an open-concept layout with stylish finishes and modern amenities. The spacious living area is perfect for entertaining guests, while the fully equipped kitchen makes meal preparation a breeze. The apartment boasts two bedrooms, providing ample space for residents or guests. With floor-to-ceiling windows, the apartment offers abundant natural light and stunning city views. Residents can enjoy access to building amenities, including a fitness center and rooftop terrace. With its central location and desirable features, this apartment is the perfect urban retreat.",
    "price": "$2,500/month",
    "status": "rent",
    "area": "800 sq ft",
    "location": "New York City, New York",
    "facilities": [
      "Elevator",
      "Fitness Center",
      "Rooftop Terrace",
      "Concierge Service",
      "Heating",
      "Media Room",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "Swimming Pool",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedrooms": 2,
    "bathrooms": 1,
    "image": "https://i.ibb.co/dGrB4zB/Home-2.png"
  },
  {
    "id": 3,
    "estate_title": "Family Home in Suburban Neighborhood",
    "category": 3,
    "description": "A perfect family home nestled in a peaceful suburban neighborhood. This charming home offers spacious interiors and outdoor space for kids and pets to play. With four bedrooms and three bathrooms, this home provides ample space for a growing family. The open-concept living area is perfect for entertaining guests, while the cozy fireplace adds warmth and ambiance. The kitchen features modern appliances and plenty of storage space. Outside, the backyard offers a private oasis with a patio and garden, perfect for outdoor gatherings. Additional features include a garage, ideal for parking or storage, and a home office for remote work. With its convenient location and family-friendly amenities, this home is a true gem.",
    "price": "$450,000",
    "status": "sale",
    "area": "2500 sq ft",
    "location": "Los Angeles, California",
    "facilities": [
      "Backyard",
      "Garage",
      "Fireplace",
      "Heating",
      "Media Room",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedrooms": 4,
    "bathrooms": 3,
    "image": "https://i.ibb.co/QYVYWMc/Home-3.png"
  },
  {
    "id": 4,
    "estate_title": "Modern Condo in Urban Setting",
    "category": 1,
    "description": "Enjoy contemporary living in this sleek modern condo located in the heart of the city. Close to amenities and vibrant nightlife, this condo offers convenience and style. The open-concept layout features floor-to-ceiling windows, providing stunning city views and abundant natural light. The gourmet kitchen is equipped with stainless steel appliances and quartz countertops, making meal preparation a delight. The spacious bedrooms offer privacy and comfort, while the luxurious bathrooms feature spa-like amenities. Residents can enjoy access to building amenities, including a gym and rooftop terrace, perfect for relaxation or entertaining guests. With its prime location and modern design, this condo is the epitome of urban living.",
    "price": "$800,000",
    "status": "sale",
    "area": "1200 sq ft",
    "location": "Chicago, Illinois",
    "facilities": [
      "Elevator",
      "Gym",
      "Rooftop Terrace",
      "Concierge Service",
      "Heating",
      "Media Room",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "Swimming Pool",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedrooms": 3,
    "bathrooms": 2,
    "image": "https://i.ibb.co/G3HR19f/Home-4.png"
  },
  {
    "id": 5,
    "estate_title": "Charming Cottage in Countryside",
    "category": 2,
    "description": "Escape to the countryside with this charming cottage surrounded by nature. Perfect for a peaceful retreat or vacation home, this cottage offers tranquility and relaxation. The cozy interior features a wood-burning fireplace and rustic decor, creating a warm and inviting atmosphere. The cottage boasts two bedrooms, providing comfortable accommodations for residents or guests. Outside, the spacious porch overlooks the lush garden and offers a serene setting for enjoying morning coffee or evening cocktails. Residents can enjoy outdoor activities such as hiking, fishing, or birdwatching in the nearby nature preserve. With its idyllic setting and charming character, this cottage is a true sanctuary.",
    "price": "$300,000",
    "status": "rent",
    "area": "1500 sq ft",
    "location": "Asheville, North Carolina",
    "facilities": [
      "Garden",
      "Porch",
      "Fire Pit",
      "Heating",
      "Media Room",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedrooms": 2,
    "bathrooms": 1,
    "image": "https://i.ibb.co/HGPYnvf/Home-5.png"
  },
  {
    "id": 6,
    "estate_title": "Spacious Townhouse in Suburban Area",
    "category": 3,
    "description": "Live comfortably in this spacious townhouse located in a serene suburban area. Perfect for families looking for peace and tranquility, this townhouse offers ample space and modern amenities. The open-concept layout features a large living area, ideal for entertaining guests or spending quality time with family. The kitchen is equipped with stainless steel appliances and granite countertops, making meal preparation a breeze. The townhouse boasts four bedrooms, providing plenty of space for residents or guests. Outside, the patio offers a private retreat, perfect for outdoor dining or relaxing in the sun. Residents can also enjoy access to community amenities such as a playground and walking trails. With its convenient location and family-friendly features, this townhouse is the perfect place to call home.",
    "price": "$600,000",
    "status": "sale",
    "area": "1800 sq ft",
    "location": "Denver, Colorado",
    "facilities": [
      "Garage",
      "Patio",
      "Study Room",
      "Heating",
      "Media Room",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedrooms": 4,
    "bathrooms": 2,
    "image": "https://i.ibb.co/nBGnBGH/Home-6.png"
  },
  {
    "id": 7,
    "estate_title": "Urban Loft with Industrial Charm",
    "category": 1,
    "description": "Experience loft living with this stylish urban loft boasting industrial charm. High ceilings, exposed brick, and modern finishes give this loft a unique and trendy vibe. The open floor plan features a spacious living area, perfect for entertaining guests or relaxing after a long day. The kitchen is equipped with stainless steel appliances and sleek countertops, making cooking a pleasure. The loft offers one bedroom and one bathroom, providing comfortable accommodations for residents. Residents can enjoy stunning city views from the loft's large windows, creating a bright and airy atmosphere. With its prime location and stylish design, this loft is perfect for urban dwellers seeking a contemporary lifestyle.",
    "price": "$1,200,000",
    "status": "sale",
    "area": "2000 sq ft",
    "location": "San Francisco, California",
    "facilities": [
      "Open Floor Plan",
      "Exposed Beams",
      "City Views",
      "Heating",
      "Media Room",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedrooms": 1,
    "bathrooms": 1,
    "image": "https://i.ibb.co/0j23kZS/Home-7.png"
  },
  {
    "id": 8,
    "estate_title": "Coastal Beach House with Panoramic Views",
    "category": 2,
    "description": "Relax and unwind in this coastal beach house with panoramic ocean views. This stunning beach house offers luxury and comfort in a picturesque setting. The spacious interior features an open-concept layout with high ceilings and floor-to-ceiling windows, providing breathtaking views of the ocean. The gourmet kitchen is equipped with top-of-the-line appliances and a large island, perfect for preparing meals and entertaining guests. The beach house boasts three bedrooms and two bathrooms, providing ample space for residents or guests. Outside, the wrap-around deck offers a perfect spot for enjoying sunsets and ocean breezes. Residents can also enjoy beachfront access and a BBQ area, making this beach house the ultimate retreat.",
    "price": "$400/night",
    "status": "rent",
    "area": "2000 sq ft",
    "location": "Santa Barbara, California",
    "facilities": [
      "Beachfront Access",
      "Wrap-around Deck",
      "BBQ Area",
      "Heating",
      "Media Room",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedrooms": 3,
    "bathrooms": 2,
    "image": "https://i.ibb.co/fvG9YxS/Home-9.png"
  },
  {
    "id": 9,
    "estate_title": "Luxury Penthouse with City Views",
    "category": 3,
    "description": "Indulge in luxury living with this exquisite penthouse offering panoramic views of the city skyline. This stunning penthouse features modern design and premium amenities, perfect for discerning buyers. The spacious interior boasts high ceilings and floor-to-ceiling windows, providing abundant natural light and spectacular views. The gourmet kitchen is equipped with top-of-the-line appliances and custom cabinetry, making cooking a delight. The penthouse offers three bedrooms and four bathrooms, including a lavish master suite with a private elevator. Residents can enjoy access to exclusive amenities such as a rooftop pool and home automation system. With its prime location and luxurious features, this penthouse offers the ultimate urban lifestyle.",
    "price": "$3,000,000",
    "status": "sale",
    "area": "4000 sq ft",
    "location": "Miami, Florida",
    "facilities": [
      "Private Elevator",
      "Rooftop Pool",
      "Home Automation System",
      "Heating",
      "Media Room",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedrooms": 3,
    "bathrooms": 4,
    "image": "https://i.ibb.co/7RPqn34/Home-8.png"
  },
  {
    "id": 10,
    "estate_title": "Modern Apartment with City View",
    "description": "Enjoy modern city living in this stylish apartment with stunning views of the city skyline. This spacious apartment features contemporary design and top-notch amenities, offering the ultimate urban lifestyle. With floor-to-ceiling windows, natural light floods the interior, creating a bright and airy ambiance. The open-concept layout seamlessly connects the living, dining, and kitchen areas, perfect for entertaining guests. The sleek kitchen is equipped with high-end appliances, granite countertops, and ample storage space. Retreat to the luxurious master bedroom with an en-suite bathroom and walk-in closet. Additional features include hardwood floors, in-unit laundry, and a private balcony overlooking the bustling cityscape. Residents also enjoy access to on-site amenities such as a fitness center, rooftop terrace, and concierge service, elevating the living experience to new heights.",
    "price": "$1,200,000",
    "status": "sale",
    "area": "1000 sq ft",
    "location": "New York City, New York",
    "facilities": ["gym", "rooftop terrace", "concierge service", "parking garage", "pet-friendly", "security system"],
    "bedrooms": 2,
    "bathrooms": 2,
    "garage": 1,
    "built_year": 2019,
    "image": "https://i.ibb.co/F8WhP1N/Home-10.png"
  },
  {
    "id": 11,
    "estate_title": "Luxury Condo in High-rise Building",
    "description": "Indulge in luxury living with this exquisite condo located in a prestigious high-rise building. Situated in the heart of Los Angeles, this sophisticated residence offers unparalleled elegance and style. The expansive floor plan features designer finishes, custom millwork, and panoramic views of the city skyline. Entertain guests in the spacious living room with floor-to-ceiling windows and a cozy fireplace. The gourmet kitchen boasts top-of-the-line appliances, quartz countertops, and a center island with bar seating. Retreat to the lavish master suite with a spa-like bathroom and oversized walk-in closet. Additional highlights include a private balcony, in-unit laundry, and smart home technology. Residents of this exclusive building enjoy access to luxury amenities such as a swimming pool, fitness center, and 24-hour concierge service, ensuring a lifestyle of comfort and convenience.",
    "price": "$3,500,000",
    "status": "sale",
    "area": "2000 sq ft",
    "location": "Los Angeles, California",
    "facilities": ["pool", "garden", "valet parking", "sauna", "wine cellar", "private elevator"],
    "bedrooms": 3,
    "bathrooms": 3,
    "garage": 2,
    "built_year": 2018,
    "image": "https://i.ibb.co/rddmvgY/Home-11.png"
  },
  {
    "id": 12,
    "estate_title": "Secluded Mountain Cabin Retreat",
    "description": "Escape to nature with this charming cabin retreat nestled in the mountains. This secluded getaway offers serenity and tranquility amid breathtaking natural surroundings. The rustic yet elegant cabin features exposed wood beams, hardwood floors, and a stone fireplace, creating a cozy and inviting atmosphere. The open-concept living area is perfect for gatherings, with a spacious kitchen, dining area, and comfortable seating. Unwind on the expansive deck overlooking the forest, or soak in the outdoor hot tub under the stars. The cabin includes three bedrooms, each thoughtfully designed for comfort and relaxation. Whether you're seeking adventure or relaxation, this mountain retreat provides the perfect backdrop for unforgettable memories.",
    "price": "$500,000",
    "status": "sale",
    "area": "1500 sq ft",
    "location": "Asheville, North Carolina",
    "facilities": ["fireplace", "deck", "hiking trails", "hot tub", "BBQ area", "WiFi"],
    "bedrooms": 3,
    "bathrooms": 2,
    "garage": 1,
    "built_year": 2015,
    "image": "https://i.ibb.co/bPQ1xpM/Home-13.png"
  },
  {
    "id": 13,
    "estate_title": "Urban Loft with Industrial Chic",
    "description": "Experience loft living with a touch of industrial chic in this stylish urban loft. Located in the heart of Chicago, this spacious loft offers a unique blend of modern design and historic charm. The open floor plan features exposed brick walls, soaring ceilings, and oversized windows, creating a light-filled and dynamic living space. The gourmet kitchen is a chef's dream, equipped with stainless steel appliances, quartz countertops, and a large island with bar seating. The expansive living area is ideal for entertaining, with plenty of room for lounging and dining. Retreat to the luxurious master suite with a spa-like bathroom and walk-in closet. Additional features include hardwood floors, in-unit laundry, and a private balcony with city views. Residents also enjoy access to a rooftop deck, fitness center, and secure parking garage.",
    "price": "$900,000",
    "status": "sale",
    "area": "1800 sq ft",
    "location": "Chicago, Illinois",
    "facilities": ["open floor plan", "exposed beams", "city views", "home office", "wine fridge", "smart home technology"],
    "bedrooms": 2,
    "bathrooms": 2,
    "garage": 1,
    "built_year": 2017,
    "image": "https://i.ibb.co/hL6fx3J/Home-14.png"
  },
  {
    "id": 14,
    "estate_title": "Riverside Cottage with Scenic Views",
    "description": "Relax and unwind in this charming riverside cottage surrounded by scenic views. Nestled along the banks of the South Platte River, this picturesque retreat offers tranquility and natural beauty. The cottage features a cozy living area with a stone fireplace, perfect for chilly evenings. The fully equipped kitchen includes stainless steel appliances and granite countertops, making meal preparation a breeze. Step outside to the spacious deck and take in the sights and sounds of the river, or gather around the fire pit for s'mores and storytelling. The cottage offers two bedrooms and one bathroom, providing comfortable accommodations for guests. Whether you're fishing, hiking, or simply enjoying the great outdoors, this riverside retreat is the perfect escape from city life.",
    "price": "$350,000",
    "status": "sale",
    "area": "1200 sq ft",
    "location": "Denver, Colorado",
    "facilities": ["porch", "river access", "fire pit", "fishing gear", "board games", "DVD player"],
    "bedrooms": 2,
    "bathrooms": 1,
    "garage": 0,
    "built_year": 2016,
    "image": "https://i.ibb.co/zSgjjHw/Home-15.png"
  },
  {
    "id": 15,
    "estate_title": "Luxury Beachfront Villa with Panoramic Ocean Views",
    "description": "Experience the epitome of luxury beachfront living in this stunning villa with panoramic ocean views. Located in Malibu, California, this exclusive property offers unparalleled elegance and sophistication. The grand foyer welcomes you into the expansive living space, adorned with high ceilings, marble floors, and floor-to-ceiling windows framing the breathtaking ocean vistas. The gourmet kitchen is a chef's dream, featuring custom cabinetry, quartz countertops, and top-of-the-line appliances. Entertain guests in the spacious family room with a fireplace and wet bar, or host dinner parties in the formal dining room overlooking the Pacific Ocean. The villa boasts five luxurious bedrooms, each with an en-suite bathroom and private balcony. Outdoor amenities include a pool, spa, outdoor kitchen, and private beach access. With meticulous attention to detail and world-class amenities, this beachfront villa offers the ultimate coastal lifestyle.",
    "price": "$10,000,000",
    "status": "sale",
    "area": "6000 sq ft",
    "location": "Malibu, California",
    "facilities": ["pool", "spa", "private beach", "outdoor kitchen", "wine cellar", "home theater"],
    "bedrooms": 5,
    "bathrooms": 5,
    "garage": 2,
    "built_year": 2019,
    "image": "https://i.ibb.co/4pmCLhN/Home-16.png"
  },
  {
    "id": 16,
    "estate_title": "Spectacular Mountain Retreat with Outdoor Hot Tub",
    "description": "Escape to the mountains with this spectacular retreat offering breathtaking views and luxurious amenities. Nestled in the Rockies, this mountain getaway provides the perfect setting for relaxation and adventure. The spacious living area features vaulted ceilings, exposed wood beams, and a stone fireplace, creating a warm and inviting atmosphere. The gourmet kitchen is equipped with high-end appliances, granite countertops, and a breakfast bar, perfect for preparing meals for family and friends. Retreat to the master suite with a private balcony and spa-like bathroom featuring a soaking tub and steam shower. Additional amenities include a game room, home theater, and outdoor hot tub overlooking the majestic peaks. Whether you're skiing in the winter or hiking in the summer, this mountain retreat offers year-round enjoyment for outdoor enthusiasts.",
    "price": "$2,000,000",
    "status": "sale",
    "area": "3500 sq ft",
    "location": "Aspen, Colorado",
    "facilities": ["hot tub", "game room", "home theater", "ski storage", "fire pit", "sauna"],
    "bedrooms": 4,
    "bathrooms": 4,
    "garage": 3,
    "built_year": 2014,
    "image": "https://i.ibb.co/3B1J4RX/Home-17.png"
  },
  {
    "id": 17,
    "estate_title": "Chic Urban Loft in Historic Warehouse District",
    "description": "Step into chic urban living with this stylish loft located in a historic warehouse district. Situated in downtown Seattle, this loft offers a blend of industrial charm and modern sophistication. The open-concept living area features exposed brick walls, polished concrete floors, and soaring ceilings, creating a contemporary loft aesthetic. The gourmet kitchen boasts stainless steel appliances, quartz countertops, and a large island with bar seating. The spacious bedroom offers privacy and comfort, with a walk-in closet and en-suite bathroom featuring a soaking tub and separate shower. Additional highlights include in-unit laundry, a private balcony, and secure parking in the building's garage. Residents also enjoy access to a rooftop deck with sweeping city views, perfect for entertaining or relaxing.",
    "price": "$1,500,000",
    "status": "sale",
    "area": "1800 sq ft",
    "location": "Seattle, Washington",
    "facilities": ["rooftop deck", "secure parking", "walk-in closet", "en-suite bathroom", "city views", "home office"],
    "bedrooms": 2,
    "bathrooms": 2,
    "garage": 2,
    "built_year": 2016,
    "image": "https://i.ibb.co/k9gtNLq/Home-18.png"
  },
  {
    "id": 18,
    "estate_title": "Luxury Penthouse with City Skyline Views",
    "description": "Indulge in luxury living with this magnificent penthouse offering breathtaking views of the city skyline. Exceptional design and premium amenities await you. This expansive penthouse boasts a sleek and modern design, with floor-to-ceiling windows offering panoramic views of the city skyline. The open-concept living space is ideal for entertaining, with a spacious living room, elegant dining area, and gourmet kitchen featuring high-end appliances and custom cabinetry. The luxurious master suite offers a peaceful retreat, with a spa-like bathroom and spacious walk-in closet. Additional features include a private elevator, rooftop pool, and home automation system, providing the ultimate in convenience and luxury. With its prime location and unparalleled amenities, this penthouse offers the epitome of urban living.",
    "price": "$4,500,000",
    "status": "sale",
    "area": "3000 sq ft",
    "location": "Los Angeles, California",
    "facilities": ["private elevator", "rooftop pool", "home automation system", "gym", "sauna", "wine cellar"],
    "bedrooms": 4,
    "bathrooms": 4,
    "garage": 3,
    "built_year": 2016,
    "image": "https://i.ibb.co/brrCN6p/Home-19.png"
  }
]
